# SortOrder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSortGroupField..::..SortOrder Property
ScheduleSortGroupField Class See Also
---
Indicates if elements in the schedule will be sorted in ascending or descending order.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleSortOrder SortOrder { get; set; }
```

Visual Basic
---
```text
Public Property SortOrder As ScheduleSortOrder
	Get
	Set
```

Visual C++
---
```text
public:
property ScheduleSortOrder SortOrder {
	ScheduleSortOrder get ();
	void set (ScheduleSortOrder value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace